interface WarningIconProps {
    size?: number;
}
const ratio = 18/20; // соотношение высоты к ширине

export const WarningIcon: React.FC<WarningIconProps> = ({ size = 20 }) => {
    const height = Math.round(size * ratio);

    return (
        <svg width={size} height={height} viewBox="0 0 20 18" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M9.92383 6.00006V10.0001M2.30273 12.1999C1.3933 13.775 0.938715 14.5629 1.00664 15.2092C1.06589 15.7729 1.36175 16.2851 1.82031 16.6182C2.34586 17.0001 3.25473 17.0001 5.07236 17.0001H14.7753C16.5929 17.0001 17.5017 17.0001 18.0272 16.6182C18.4858 16.2851 18.7818 15.7729 18.841 15.2092C18.9089 14.5629 18.4545 13.775 17.5451 12.1999L12.6953 3.79986C11.7859 2.22468 11.331 1.43722 10.7373 1.17291C10.2195 0.942364 9.62783 0.942364 9.11002 1.17291C8.51661 1.43711 8.06197 2.22458 7.15329 3.79845L2.30273 12.1999ZM9.97461 13.0001V13.1001L9.87402 13.1003V13.0001H9.97461Z" stroke="#FFD235" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
    );
};
